app/views/sub_categories/_form.html.erb

    <%= f.inputs do %>
        <%= f.input :category, :as => :select, :collection => Category.all.collect {|c| [c.title, c.id]}, :prompt => 'Select category', :wrapper_html => {:style => 'width: 56%'} %>
---
SELECT `categories`.* FROM `categories`